app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "toto only "], ["body", "ezaerareaz\nezaraera"], ["created_at", "2022-04-05 11:33:45.354965"], ["updated_at", "2022-04-05 11:33:45.354965"], ["status", "public"]]
---
  def create
	@article = Article.new(article_params)
	if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Hello Rails edited"], ["updated_at", "2022-03-29 13:17:55.039887"], ["id", 1]]
---
  def update
	@article = Article.find(params[:id])
	if @article.update(article_params)