app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["commenter", "titi"], ["body", "destroy me babe"], ["article_id", 8], ["created_at", "2022-04-05 11:29:43.344820"], ["updated_at", "2022-04-05 11:29:43.344820"], ["status", "public"]]

	def destroy
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
		@comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 5], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]